DROP DATABASE IF EXISTS Base_Datos_Futbol;
CREATE DATABASE Base_Datos_Futbol;
USE Base_Datos_Futbol;
DROP TABLE Equipos;
CREATE TABLE Equipos (
id INT UNSIGNED AUTO_INCREMENT PRIMARY KEY,
nombre VARCHAR (80),
año_fundacion SMALLINT,
id_estadio INT UNSIGNED,
id_localidad INT UNSIGNED,
id_pais INT UNSIGNED,
partidos_vistos INT,
FOREIGN KEY (id_estadio) REFERENCES Estadios (id), 
FOREIGN KEY (id_localidad) REFERENCES Localidad (id), 
FOREIGN KEY (id_pais) REFERENCES Pais (id)
);
CREATE TABLE Localidad (
id INT UNSIGNED AUTO_INCREMENT PRIMARY KEY,
nombre VARCHAR (80),
id_pais INT UNSIGNED,
FOREIGN KEY (id_pais) REFERENCES Pais (id)
);
CREATE TABLE Pais (
id INT UNSIGNED AUTO_INCREMENT PRIMARY KEY,
nombre VARCHAR (80)
);
CREATE TABLE Estadios (
id INT UNSIGNED AUTO_INCREMENT PRIMARY KEY,
nombre VARCHAR (80),
id_localidad INT UNSIGNED,
id_pais INT UNSIGNED,
FOREIGN KEY (id_localidad) REFERENCES Localidad (id), 
FOREIGN KEY (id_pais) REFERENCES Pais (id)
);
CREATE TABLE Competiciones (
id INT UNSIGNED AUTO_INCREMENT PRIMARY KEY,
nombre VARCHAR (80),
id_pais INT UNSIGNED,
FOREIGN KEY (id_pais) REFERENCES Pais (id)
);
CREATE TABLE Jugadores (
id INT UNSIGNED AUTO_INCREMENT PRIMARY KEY,
nombre VARCHAR (80),
apellido1 VARCHAR (80),
apellido2 VARCHAR (80),
fecha_nacimiento DATE,
id_localidad  INT UNSIGNED,
id_pais INT UNSIGNED,
id_equipo INT UNSIGNED,
posicion VARCHAR (30),
activo BOOLEAN,
FOREIGN KEY (id_localidad) REFERENCES Localidad (id), 
FOREIGN KEY (id_pais) REFERENCES Pais (id),
FOREIGN KEY (id_equipo) REFERENCES Equipos (id)
);
CREATE TABLE Goles_marcados (
id_jugador INT UNSIGNED PRIMARY KEY,
id_equipo INT UNSIGNED,
numero_goles INT,
FOREIGN KEY (id_jugador) REFERENCES Jugadores (id),
FOREIGN KEY (id_equipo) REFERENCES Equipos (id)
);
CREATE TABLE Partidos_jugados (
id_jugador INT UNSIGNED PRIMARY KEY,
id_equipo INT UNSIGNED,
numero_partidos INT,
FOREIGN KEY (id_jugador) REFERENCES Jugadores (id),
FOREIGN KEY (id_equipo) REFERENCES Equipos (id)
);
CREATE TABLE Entrenadores (
id INT UNSIGNED AUTO_INCREMENT PRIMARY KEY,
nombre VARCHAR (80),
apellido1 VARCHAR (80),
apellido2 VARCHAR (80),
fecha_nacimiento DATE,
id_localidad  INT UNSIGNED,
id_pais INT UNSIGNED,
id_equipo INT UNSIGNED,
activo BOOLEAN,
FOREIGN KEY (id_localidad) REFERENCES Localidad (id), 
FOREIGN KEY (id_pais) REFERENCES Pais (id),
FOREIGN KEY (id_equipo) REFERENCES Equipos (id)
);
CREATE TABLE Partidos_entrenados (
id INT UNSIGNED AUTO_INCREMENT PRIMARY KEY,
id_entrenador INT UNSIGNED,
id_equipo INT UNSIGNED,
numero_partidos INT,
FOREIGN KEY (id_entrenador) REFERENCES Entrenadores (id),
FOREIGN KEY (id_equipo) REFERENCES Equipos (id)
);
CREATE TABLE Partidos (
id INT UNSIGNED AUTO_INCREMENT PRIMARY KEY,
id_equipo_local INT UNSIGNED,
id_equipo_visitante INT UNSIGNED,
resultado VARCHAR (10),
total_goles INT,
fecha DATE,
id_temporada INT UNSIGNED,
id_competicion INT UNSIGNED,
id_estadio INT UNSIGNED,
FOREIGN KEY (id_equipo_local) REFERENCES Equipos (id),
FOREIGN KEY (id_equipo_visitante) REFERENCES Equipos (id),
FOREIGN KEY (id_competicion) REFERENCES Competiciones (id),
FOREIGN KEY (id_estadio) REFERENCES Estadios (id),
FOREIGN KEY (id_temporada) REFERENCES Temporadas (id)
);
CREATE TABLE Temporadas (
id INT UNSIGNED AUTO_INCREMENT PRIMARY KEY,
temporada VARCHAR (20)
);

SELECT el.nombre, ev.nombre, p.resultado, p.fecha, t.temporada, c.nombre, es.nombre
FROM Equipos el JOIN Partidos p ON el.id=p.id_equipo_local
JOIN Equipos ev ON ev.id=p.id_equipo_visitante
JOIN Temporadas t ON t.id=p.id_temporada
JOIN Competiciones c ON c.id=p.id_competicion
JOIN Estadios es ON es.id=p.id_estadio
ORDER BY p.fecha;

UPDATE Equipos SET nombre = 'RCD Espanyol' WHERE id = 13;

-- Aquí metemos los entrenadores --
INSERT INTO Entrenadores (nombre, apellido1, apellido2, fecha_nacimiento, id_localidad, id_pais, id_equipo, activo) VALUES
('José', 'Bordalás', 'Jiménez', '1964-03-05', 47, 1, 1, TRUE), ('Quique', 'Sánchez', 'Flores', '1965-02-02', 2, 1, NULL, TRUE), ('Bernhard', 'Schuster', NULL, '1959-12-22', 62, 12, NULL, FALSE);

-- Aquí metemos los partidos entrenados por cada entrenador --
INSERT INTO Partidos_entrenados (id_entrenador, id_equipo, numero_partidos) VALUES
(1, 1, 106), (1, 6, 1);

-- Aquí metemos los partidos --
INSERT INTO Partidos (id_equipo_local, id_equipo_visitante, resultado, total_goles, fecha, id_temporada, id_competicion, id_estadio) VALUES 
(1, 11, '3-1', 4, '2004-10-03', 1, 1, 1), (1, 10, '0-2', 2, '2004-10-24', 1, 1, 1), (1, 6, '1-0', 1, '2004-11-07', 1, 1, 1), (1, 20, '1-0', 1, '2004-11-13', 1, 1, 1), (1, 7, '1-2', 3, '2004-11-27', 1, 1, 1), (1, 8, '1-2', 3, '2004-12-12', 1, 1, 1), (1, 17, '2-0', 2, '2004-12-22', 1, 1, 1),
(1, 5, '1-1', 2, '2005-01-15', 1, 1, 1), (1, 23, '3-0', 3, '2005-01-23', 1, 1, 1), (1, 42, '1-0', 1, '2005-02-06', 1, 1, 1), (1, 12, '0-0', 0, '2005-02-20', 1, 1, 1), (3, 10, '3-1', 4, '2005-03-02', 1, 1, 3), (1, 3, '2-1', 3, '2005-03-13', 1 , 1, 1), (1, 37, '1-0', 1, '2005-04-10', 1, 1, 1),
(1, 14, '1-0', 1, '2005-04-24', 1, 1, 1), (1, 15, '2-0', 2, '2005-05-08', 1, 1, 1), (1, 4, '0-0', 0, '2005-05-22', 1, 1, 1), (1, 11, '1-1', 2, '2005-09-11', 2, 1, 1), (1, 9, '1-1', 2, '2005-09-21', 2, 1, 1), (1, 6, '2-1', 3, '2005-10-01', 2, 1, 1), (1, 23, '5-2', 7, '2005-10-23', 2, 1, 1),
(1, 7, '1-3', 4, '2005-11-06', 2, 1, 1), (1, 12, '0-0', 0, '2005-11-19', 2, 1, 1), (1, 20, '3-2', 5, '2005-11-27', 2, 1, 1), (1, 17, '1-2', 3, '2005-12-11', 2, 1, 1), (1, 4, '1-0', 1, '2005-12-21', 2, 1, 1), (1, 18, '1-1', 2, '2006-01-15', 2, 1, 1), (1, 13, '5-0', 5, '2006-01-22', 2, 1, 1),
(1, 19, '2-2', 4, '2006-02-05', 2, 1, 1), (1, 5, '0-3', 3, '2006-02-19', 2, 1, 1), (1, 10, '1-0', 1, '2006-02-05', 2, 1, 1), (1, 21, '1-2', 3, '2006-03-18', 2, 1, 1), (1, 15, '2-1', 3, '2006-03-26', 2, 1, 1), (1, 3, '1-1', 2, '2006-04-16', 2, 1, 1), (1, 8, '1-1', 2, '2006-04-30', 2, 1, 1),
(1, 28, '3-1', 4, '2006-05-07', 2, 1, 1), (1, 17, '1-0', 1, '2006-09-10', 3, 1, 1), (1, 11, '0-0', 0, '2006-09-24', 3, 1, 1), (1, 3, '1-0', 1, '2006-10-14', 3, 1, 1), (1, 21, '2-0', 2, '2006-10-29', 3, 1, 1), (1, 9, '1-0', 1, '2006-11-12', 3, 1, 1), (1, 14, '0-0', 0, '2006-11-26', 3, 1, 1),
(1, 10, '1-1', 2, '2006-12-10', 3, 1, 1), (1, 13, '0-1', 1, '2006-12-20', 3, 1, 1), (1, 7, '1-1', 2, '2007-01-07', 3, 1, 1), (1, 18, '1-0', 1, '2007-01-21', 3, 1, 1), (1, 12, '2-0', 2, '2007-01-28', 3, 1, 1), (1, 6, '3-0', 3, '2007-02-11', 3, 1, 1), (1, 4, '0-0', 0, '2007-02-05', 3, 1, 1),
(1, 33, '1-1', 2, '2007-03-11', 3, 1, 1), (1, 23, '2-2', 4, '2007-04-01', 3, 1, 1), (1, 8, '3-0', 3, '2007-04-15', 3, 1, 1), (1, 15, '1-0', 1, '2007-04-29', 3, 1, 1), (1, 5, '1-4', 5, '2007-05-13', 3, 1, 1), (1, 41, '0-1', 1, '2007-06-10', 3, 1, 1), (1, 33, '1-1', 2, '2007-09-02', 4, 1, 1),
(1, 61, '1-0', 1, '2007-09-20', 4, 6, 1), (1, 21, '0-0', 0, '2007-09-23', 4, 1, 1), (1, 3, '0-1', 1, '2007-09-30', 4, 1, 1), (1, 39, '2-0', 2, '2007-10-21', 4, 1, 1), (1, 11, '2-0', 2, '2007-10-31', 4, 1, 1), (1, 7, '2-0', 2, '2007-11-10', 4, 1, 1), (1, 46, '1-2', 3, '2007-11-29', 4, 6, 1),
(1, 14, '2-1', 3, '2007-12-02', 4, 1, 1), (1, 8, '1-3', 4, '2007-12-16', 4, 1, 1), (1, 49, '2-1', 3, '2007-12-19', 4, 6, 1), (1, 56, '4-1', 5, '2008-01-02', 4, 4, 1), (1, 16, '0-3', 3, '2008-01-06', 4, 1, 1), (1, 14, '3-0', 3, '2008-01-09', 4, 4, 1), (1, 4, '3-2', 5, '2008-01-19', 4, 1, 1),
(1, 9, '1-0', 1, '2008-01-23', 4, 4, 1), (1, 13, '0-1', 1, '2008-02-03', 4, 1, 1), (1, 6, '0-0', 0, '2008-02-17', 4, 1, 1), (1, 51, '3-0', 3, '2008-02-21', 4, 6, 1), (1, 17, '3-1', 4, '2008-02-28', 4, 4, 1), (1, 9, '3-3', 6, '2008-03-02', 4, 1, 1), (1, 64, '1-0', 1, '2008-03-12', 4, 6, 1),
(1, 17, '2-1', 3, '2008-03-16', 4, 1, 1), (17, 1, '1-1', 2, '2008-03-19', 4, 4, 17), (1, 12, '0-2', 2, '2008-03-30', 4, 1, 1), (1, 68, '3-3', 6, '2008-04-10', 4, 6, 1), (1, 23, '0-0', 0, '2008-04-13', 4, 1, 1), (6, 1, '3-1', 4, '2008-04-16', 4, 4, 74), (1, 5, '1-1', 2, '2008-04-27', 4, 1, 1),
(1, 22, '4-2', 6, '2008-05-07', 4, 1, 1), (1, 10, '1-1', 2, '2008-05-18', 4, 1, 1), (2, 76, '1-0', 1, '2008-06-01', 4, 3, 2), (2, 77, '1-1', 2, '2008-06-15', 4, 3, 2), (3, 44, '5-3', 8, '2008-08-27', 5, 9, 3), (2, 39, '1-0', 1, '2008-08-30', 5, 2, 2), (2, 19, '2-1', 3, '2008-09-13', 5, 2, 2),
(1, 10, '0-0', 0, '2008-09-14', 5, 1, 1), (1, 5, '1-2', 3, '2008-09-24', 5, 1, 1), (2, 43, '3-3', 6, '2008-09-28', 5, 2, 2), (1, 22, '2-2', 4, '2008-10-05', 5, 1, 1), (2, 53, '4-2', 6, '2008-10-12', 5, 2, 2), (2, 30, '4-1', 5, '2008-10-25', 5, 2, 2), (1, 16, '1-0', 1, '2008-10-26', 5, 1, 1),
(1, 12, '0-0', 0, '2008-10-29', 5, 4, 1), (1, 35, '1-0', 1, '2008-11-08', 5, 2, 2), (1, 6, '0-3', 3, '2008-11-09', 5, 1, 1), (1, 4, '0-2', 2, '2008-11-16', 5, 1, 1), (2, 70, '0-0', 0, '2008-11-23', 5, 2, 2), (1, 3, '3-1', 4, '2008-11-29', 5, 1, 1), (2, 69, '1-1', 2, '2008-12-06', 5, 2, 2), 
(1, 9, '4-1', 5, '2008-12-14', 5, 1, 1), (1, 21, '1-2', 3, '2009-01-04', 5, 1, 1), (2, 27, '1-1', 2, '2009-01-17', 5, 2, 2), (1, 17, '0-1', 1, '2009-01-18', 5, 1, 1), (1, 40, '5-1', 6, '2009-01-25', 5, 1, 1), (2, 55, '1-0', 1, '2009-02-07', 5, 2, 2), (1, 13, '1-1', 2, '2009-02-08', 5, 1, 1),
(2, 62, '1-0', 1, '2009-02-21', 5, 2, 2), (1, 11, '1-1', 2, '2009-02-22', 5, 1, 1), (2, 24, '1-1', 2, '2009-03-07', 5, 2, 2), (1, 20, '1-2', 3, '2009-03-08', 5, 1, 1), (2, 41, '3-2', 5, '2009-03-22', 5, 2, 2), (1, 33, '2-1', 3, '2009-03-22', 5, 1, 1), (2, 31, '0-0', 0, '2009-04-04', 5, 2, 2),
(1, 7, '0-1', 1, '2009-04-18', 5, 1, 1), (1, 8, '1-2', 3, '2009-04-26', 5, 1, 1), (2, 37, '0-3', 3, '2009-05-02', 5, 2, 2), (1, 12, '3-0', 3, '2009-05-10', 5, 1, 1), (2, 29, '5-0', 5, '2009-05-16', 5, 2, 2), (1, 42, '1-0', 1, '2009-05-23', 5, 1, 1), (2, 32, '1-2', 3, '2009-05-24', 5, 2, 2), 
(17, 1, '1-1', 2, '2009-05-31', 5, 1, 17), (2, 15, '4-1', 5, '2009-06-06', 5, 2, 2), (2, 23, '2-2', 4, '2009-06-20', 5 ,2, 2), (1, 7, '0-2', 2, '2009-09-12', 6, 1, 1), (1, 6, '3-1', 4, '2009-09-23', 6, 1, 1), (1, 12, '2-1', 3, '2009-10-04', 6, 1, 1), (1, 11, '2-0', 2, '2009-10-25', 6, 1, 1),
(1, 13, '2-0', 2, '2009-10-28', 6, 4, 1), (1, 21, '0-2', 2, '2009-11-07', 6, 1, 1), (1, 43, '5-1', 6, '2009-11-29', 6, 1, 1), (1, 31, '2-1', 3, '2009-12-13', 6, 1, 1), (1, 16, '1-0', 1, '2010-01-03', 6, 1, 1), (1, 20, '5-1', 6, '2010-01-13', 6, 4, 1), (1, 5, '1-0', 1, '2010-01-24', 6, 1, 1),
(1, 9, '0-1', 1, '2010-01-28', 6, 4, 1), (1, 17, '0-0', 0, '2010-01-31', 6, 1, 1), (1, 4, '1-0', 1, '2010-02-10', 6, 4, 1), (1, 22, '2-2', 4, '2010-02-14', 6, 1, 1), (1, 23, '0-2', 2, '2010-02-27', 6, 1, 1), (1, 9, '3-0', 3, '2010-03-13', 6, 1, 1), (1, 3, '2-4', 6, '2010-03-25', 6, 1, 1),
(1, 13, '1-1', 2, '2010-04-04', 6, 1, 1), (1, 8, '3-0', 3, '2010-04-13', 6, 1, 1), (1, 5, '4-3', 7, '2010-04-25', 6, 1, 1), (16, 1, '0-0', 0, '2010-05-01', 6, 1, 16), (1, 40, '1-1', 2, '2010-05-04', 6, 1, 1), (1, 20, '2-1', 3, '2010-05-08', 6, 1, 1), (3, 63, '4-0', 4, '2010-12-08', 7, 7, 3),
(3, 14, '2-0', 2, '2011-02-19', 7, 1, 3), (59, 66, '0-2', 2, '2011-05-22', 7, 3, 3), (3, 71, '4-0', 4, '2011-10-18', 8, 7, 3), (1, 9, '1-3', 4, '2012-04-28', 8, 1, 1), (1, 38, '0-0', 0, '2012-11-28', 9, 4, 1), (3, 5, '1-2', 3, '2013-05-17', 9, 4, 1), (3, 73, '2-1', 3, '2013-10-23', 10, 7, 3),
(1, 4, '1-0', 1, '2014-05-11', 10, 1, 1), (1, 6, '0-3', 3, '2014-09-22', 11, 1, 1), (1, 20, '1-0', 1, '2014-09-28', 11, 1, 1), (1, 29, '1-1', 2, '2014-10-03', 11, 1, 1), (1, 5, '0-1', 1, '2014-10-26', 11, 1, 1), (3, 58, '1-0', 1, '2014-11-04', 11, 7, 3), (1, 32, '0-0', 0, '2014-11-08', 11, 1, 1),
(1, 11, '1-2', 3, '2014-11-29', 11, 1, 1), (1, 30, '3-0', 3, '2014-12-05', 11, 4, 1), (1, 7, '0-0', 0, '2014-12-13', 11, 1, 1), (1, 2, '1-2', 3, '2015-01-04', 11, 1, 1), (1, 22, '1-0', 1, '2015-01-14', 11, 4, 1), (1, 3, '0-3', 3, '2015-01-18', 11, 1, 1), (1, 18, '2-1', 3, '2015-01-26', 11, 1, 1),
(1, 8, '0-1', 1, '2015-01-29', 11, 4, 1), (1, 4, '2-1', 3, '2015-02-08', 11, 1, 1), (1, 13, '2-1', 3, '2015-02-20', 11, 1, 1), (1, 15, '0-1', 1, '2015-03-16', 11, 1, 1), (3, 26, '9-1', 10, '2015-04-05', 11, 1, 3), (1, 21, '2-1', 3, '2015-04-05', 11, 1, 1), (1, 8, '1-1', 2, '2015-04-12', 11, 1, 1),
(1, 14, '0-1', 1, '2015-04-25', 11, 1, 1), (1, 26, '1-2', 3, '2015-05-03', 11, 1, 1), (1, 30, '1-1', 2, '2015-05-17', 11, 1, 1), (1, 14, '2-0', 2, '2017-04-08', 12, 2, 1), (1, 29, '2-0', 2, '2017-05-07', 12, 2, 1), (1, 35, '3-0', 3, '2017-06-17', 12, 2, 1), (1, 31, '3-1', 4, '2017-06-24', 12, 2, 1), 
(1, 5, '0-0', 0, '2017-08-11', 13, 8, 1), (1, 4, '0-1', 1, '2017-08-27', 13, 1, 1), (1, 7, '1-2', 3, '2017-09-16', 13, 1, 1), (1, 8, '4-0', 4, '2017-09-24', 13, 1, 1), (1, 3, '1-2', 3, '2017-10-14', 13, 1, 1), (1, 19, '0-1', 1, '2017-10-24', 13, 4, 1), (1, 15, '2-1', 3, '2017-10-29', 13, 1, 1),
(1, 19, '4-1', 5, '2017-11-18', 13, 1, 1), (1, 6, '1-0', 1, '2017-12-03', 13, 1, 1), (1, 30, '0-0', 0, '2017-12-09', 13, 1, 1), (1, 27, '2-0', 2, '2017-12-20', 13, 1, 1), (1, 20, '1-0', 1, '2018-01-12', 13, 1, 1), (1, 11, '2-2', 4, '2018-01-19', 13, 1, 1), (1, 25, '0-0', 0, '2018-02-04', 13, 1, 1),
(1, 18, '3-0', 3, '2018-02-19', 13, 1, 1), (1, 21, '3-0', 3, '2018-02-28', 13, 1, 1), (1, 14, '0-1', 1, '2018-03-10', 13, 1, 1), (1, 10, '0-1', 1, '2018-04-02', 13, 1, 1), (5, 44, '2-0', 2, '2018-04-05', 13, 6, 5), (1, 13, '1-0', 1, '2018-04-15', 13, 1, 1), (1, 24, '1-1', 2, '2018-04-29', 13, 1, 1),
(1, 5, '0-1', 1, '2018-05-12', 13, 1, 1), (1, 16, '0-0', 0, '2018-08-31', 14, 1, 1), (1, 5, '0-2', 2, '2018-09-22', 14, 1, 1), (1, 14, '0-1', 1, '2018-10-06', 14, 1, 1), (1, 10, '2-0', 2, '2018-10-28', 14, 1, 1), (1, 6, '0-1', 1, '2018-11-10', 14, 1, 1), (1, 13, '3-0', 3, '2018-12-01', 14, 1, 1),
(1, 29, '5-1', 6, '2018-12-04', 14, 4, 1), (1, 15, '1-0', 1, '2018-12-15', 14, 1, 1), (1, 7, '1-2', 3, '2019-01-06', 14, 1, 1), (1, 16, '1-0', 1, '2019-01-09', 14, 4, 1), (1, 19, '4-0', 4, '2019-01-18', 14, 1, 1), (1, 6, '1-0', 1, '2019-01-22', 14, 4, 1), (1, '3-1', 4, '2019-02-09', 14, 1, 1),
(1, 2, '2-1', 3, '2019-02-23', 14, 1, 1), (34, 48, '0-1', 1, '2019-03-03', 14, 3, 34), (1, 35, '2-1', 3, '2019-03-09', 14, 1, 1), (57, 36, '0-0', 0, '2019-03-10', 14, 3, 55), (65, 67, '0-2', 2, '2019-03-17', 14, 5, 5), (1, 25, '0-2', 2, '2019-03-30', 14, 1, 1), (1, 11, '1-0', 1, '2019-04-07', 14, 1, 1),
(1, 4, '3-0', 3, '2019-04-21', 14, 1, 1), (1, 3, '0-0', 0, '2019-04-25', 14, 1, 1), (1, 24, '2-0', 2, '2019-05-05', 14, 1, 1), (1, 8, '2-2', 4, '2019-05-18', 14, 1, 1), (1, 54, '1-0', 1, '2019-08-02', 15, 8, 1), (1, 19, '1-1', 2, '2019-08-31', 15, 1, 1), (1, 9, '4-2', 6, '2019-09-22', 15, 1, 1),
(3, 12, '2-0', 2, '2019-09-25', 15, 1, 3), (1, 7, '0-2', 2, '2019-09-28', 15, 1, 1), (1, 25, '2-0', 2, '2019-10-19', 15, 1, 1), (1, 72, '0-1', 1, '2019-10-24', 15, 6, 1), (1, 26, '3-1', 4, '2019-10-31', 15, 1, 1), (1, 12, '0-0', 0, '2019-11-10', 15, 1, 1), (1, 14, '4-0', 4, '2019-12-01', 15, 1, 1),
(1, 16, '2-0', 2, '2019-12-15', 15, 1, 1), (1, 3, '0-3', 3, '2020-01-04', 15, 1, 1), (1, 10, '1-0', 1, '2020-01-26', 15, 1, 1), (1, 47, '2-0', 2, '2020-02-20', 15, 6, 1), (1, 4, '0-3', 3, '2020-02-23', 15, 1, 1), (1, 18, '0-0', 0, '2020-03-07', 15, 1, 1), (52, 60, '1-2', 3, '2020-12-06', 16, 3, 50),
(34, 27, '1-0', 1, '2021-01-06', 16, 4, 34), (34, 26, '0-6', 6, '2021-01-28', 16, 4, 34), (1, 4, '0-1', 1, '2021-08-23', 17, 1, 1), (1, 32, '0-1', 1, '2021-03-13', 17, 1, 1), (1, 5, '1-2', 3, '2021-09-21', 17, 1, 1), (1, 13, '2-1', 3, '2021-10-31', 17, 1, 1), (1, 28, '4-0', 4, '2021-11-21', 17, 1, 1), 
(1, 11, '0-0', 0, '2021-12-06', 17, 1, 1), (1, 14, '3-0', 3, '2022-02-04', 17, 1, 1), (1, 6, '0-0', 0, '2022-03-12', 17, 1, 1), (1, 9, '1-0', 1, '2022-04-02', 17, 1, 1), (1, 8, '1-2', 3, '2022-04-16', 17, 1, 1), (32, 38, '2-3', 5, '2022-04-23', 17, 2, 36), (1, 10, '0-0', 0, '2022-05-02', 17, 1, 1), 
(1, 2, '0-0', 0, '2022-05-08', 17, 1, 1), (1, 7, '0-0', 0, '2022-05-15', 17, 1, 1), (25, 1, '2-0', 2, '2022-07-16', 18, 8, 25), (1, 5, '0-3', 3, '2022-08-15', 18, 1, 1), (1, 8, '0-0', 0, '2022-08-28', 18, 1, 1), (1, 15, '2-1', 3, '2022-09-11', 18, 1, 1), (1, 16, '2-3', 5, '2022-10-1', 18, 1, 1), 
(1, 3, '0-1', 1, '2022-10-08', 18, 1, 1), (1, 11, '2-2', 4, '2022-10-18', 18, 1, 1), (1, 28, '0-0', 0, '2022-11-05', 18, 1, 1), (1, 9, '2-0', 2, '2022-12-30', 18, 1, 1), (1, 13, '1-2', 3, '2023-01-15', 18, 1, 1), (1, 10, '0-1', 1, '2023-01-28', 18, 1, 1), (1, 2, '1-1', 2, '2023-02-12', 18, 1, 1), 
(1, 6, '1-0', 1, '2023-02-20', 18, 1, 1), (1, 24, '3-2', 5, '2023-03-04', 18, 1, 1), (1, 4, '2-0', 2, '2023-03-19', 18, 1, 1), (1, 7, '0-0', 0, '2023-04-16', 18, 1, 1), (1, 22, '1-2', 3, '2023-04-26', 18, 1, 1), (1, 18, '1-0', 1, '2023-05-03', 18, 1, 1), (1, 12, '2-1', 3, '2023-05-28', 18, 1, 1), 
(1, 7, '0-0', 0, '2023-08-13', 19, 1, 1), (1, 19, '1-0', 1, '2023-08-28', 19, 1, 1), (1, 12, '3-2', 5, '2023-09-17', 19, 1, 1), (1, 8, '0-0', 0, '2023-09-30', 19, 1, 1), (1, 10, '1-1', 1, '2023-10-21', 19, 1, 1), (1, 28, '1-0', 1, '2023-11-06', 19, 1,  1), (1, 22, '2-1', 3, '2023-11-25', 19, 1, 1), 
(1, 6, '1-0', 1, '2023-12-08', 19, 1, 1), (4, 1, '0-3', 3, '2023-12-16', 19, 1, 4), (1, 2, '0-2', 2, '2024-01-02', 19, 1, 5), (1, 4, '1-3', 4, '2024-01-16', 19, 4, 1), (1, 26, '2-0', 2, '2024-01-29', 19, 1, 1), (1, 3, '0-2', 2, '2024-02-01', 19, 1, 1), (1, 18, '3-2', 5, '2024-02-11', 19, 1, 1), 
(1, 27, '3-3', 6, '2024-03-02', 19, 1, 1), (1, 24, '1-0', 1, '2024-03-16', 19, 1, 1), (50, 45, '3-3', 6, '2024-03-26', 19, 8, 3), (1, 4, '0-1', 1, '2024-03-30', 19, 1, 1), (2, 1, '0-0', 0, '2024-04-13', 19, 1, 2), (1, 15, '1-1', 2, '2024-04-21', 19, 1, 1), (1, 11, '0-2', 2, '2024-05-03', 19, 1, 1), 
(1, 5, '0-3', 3, '2024-05-15', 19, 1, 1), (1, 9, '1-2', 3, '2024-05-16', 19, 1, 1), (1, 74, '1-0', 1, '2024-08-07', 20, 8, 1), (1, 2, '0-0', 0, '2024-08-24', 20, 1, 1), (3, 16, '3-0', 3, '2024-08-25', 20, 1, 3), (1, 15, '0-0', 0, '2024-09-01', 20, 1, 1), (1, 25, '1-1', 2, '2024-09-22', 20, 1, 1), 
(1, 19, '2-0', 2, '2024-09-28', 20, 1, 1), (1, 12, '1-1', 2, '2024-10-05', 20, 1, 1), (1, 6, '1-1', 2, '2024-10-27', 20, 1, 1), (1, 24, '0-1', 1, '2024-11-10', 20, 1, 1), (1, 16, '2-0', 2, '2024-11-22', 20, 1, 1), (75, 6, '0-1', 1, '2024-11-26', 20, 4, 73), (1, 13, '1-0', 1, '2024-12-09', 20, 1, 1), 
(5, 1, '1-0', 1, '2024-12-15', 20, 1, 5), (1, 9, '0-1', 1, '2024-12-21', 20, 1, 1), (1, 7, '0-0', 0, '2025-01-19', 20, 1, 1), (1, 4, '0-0', 0, '2025-02-01', 20, 1, 1), (5, 1, '5-0', 5, '2025-02-04', 20, 4, 5), (1, 10, '1-2', 3, '2025-02-23', 20, 1, 1), (25, 1, '1-0', 1, '2025-03-02', 20, 1, 25), 
(1, 5, '2-1', 3, '2025-03-09', 20, 1, 1), (1, 8, '1-2', 3, '2025-03-30', 20, 1, 1), (1, 27, '1-2', 3, '2025-04-12', 20, 1, 1), (1, 3, '0-1', 1, '2025-04-23', 20, 1, 1), (1, 11, '0-2', 2, '2025-05-15', 20, 1, 1), (1, 18, '1-2', 3, '2025-05-25', 20, 1, 1), (6, 1, '3-0', 3, '2025-08-29', 21, 1, 6), 
(52, 34, '3-2', 5, '2025-09-07', 21, 10, 50);

INSERT INTO Partidos (id_equipo_local, id_equipo_visitante, resultado, total_goles, fecha, id_temporada, id_competicion, id_estadio) VALUES 

-- Aquí metemos los equipos --
INSERT INTO Equipos (nombre, año_fundacion, id_estadio, id_localidad, id_pais, partidos_vistos) VALUES
('Getafe CF', 1983, 1, 1, 1, 292), ('Rayo Vallecano de Madrid', 1924, 2, 2, 1, 26), ('Real Madrid CF', 1902, 3, 2, 1, 24), ('Sevilla FC', 1890, 4, 3, 1, 18), ('Club Atlético de Madrid', 1903, 5, 2, 1, 18), ('Valencia CF', 1919, 6, 4, 1, 16),
('FC Barcelona', 1899, 7, 5, 1, 14), ('Villarreal CF', 1923, 8, 6, 1, 14), ('RCD Mallorca', 1916, 9, 7, 1, 13), ('Real Betis Balompié', 1907, 10, 3, 1, 13), ('Athletic Club', 1898, 11, 8, 1, 13), ('Club Atlético Osasuna', 1920, 12, 9, 1, 12), ('Espanyol', 1900, 13, 5, 1, 12), 
('UD Levante', 1909, 14, 4, 1, 11), ('Real Sociedad de Fútbol', 1909, 15, 10, 1, 10), ('Real Valladolid CF', 1928, 16, 11, 1, 10), ('Real Racing Club de Santander', 1913, 17, 12, 1, 9), ('Real Club Celta de Vigo', 1923, 18, 13, 1, 9), ('Deportivo Alavés', 1921, 19, 14, 1, 8), 
('Málaga CF', 1904, 20, 15, 1, 7), ('Real Club Deportivo de la Coruña', 1906, 21, 16, 1, 7), ('UD Almería', 1989, 22, 17, 1, 6), ('Real Zaragoza', 1932, 23, 18, 1, 6), ('Girona FC', 1930, 24, 19, 1, 6), ('CD Leganés', 1928, 25, 20, 1, 6),
('Granada CF', 1931, 26, 21, 1, 5), ('UD Las Palmas', 1949, 27, 22, 1, 5), ('Cádiz CF', 1910, 28, 23, 1, 4), ('Córdoba CF', 1954, 29, 24, 1, 4), ('SD Eibar', 1940, 30, 25, 1, 4), ('CD Tenerife', 1922, 31, 26, 1, 3), ('Elche CF', 1923, 32, 27, 1, 3),
('Real Club Recreativo de Huelva', 1889, 33, 28, 1, 3), ('CDA Navalcarnero', 1961, 34, 29, 1, 3), ('SD Huesca', 1960, 35, 30, 1, 3), ('Fuenlabrada CF', 1975, 36, 31, 1, 2), ('Albacete Balompié', 1940, 37, 32, 1, 2), ('SD Ponferradina', 1922, 38, 33, 1, 2),
('Real Murcia CF', 1919, 39, 34, 1, 2), ('Real Sporting de Gijón', 1905, 40, 35, 1, 2), ('Club Gimnàstic de Tarragona', 1886, 41, 36, 1, 2), ('CD Numancia', 1945, 42, 37, 1, 2), ('Xérez CD', 1947, 43, 38, 1, 2), ('Club Sporting de Portugal', 1906, 44, 39, 2, 2),
('Selección Brasileña de Fútbol', 1914, NULL, NULL, 3, 1), ('Hapoel de Tel Aviv FC', 1923, 45, 40, 4, 1), ('Ajax de Ámsterdam', 1900, 46, 41, 5, 1), ('Cultural y Deportiva Leonesa', 1923, 47, 42, 1, 1), ('RSC Anderlecht', 1908, 48, 43, 6, 1), 
('Selección Española de Fútbol', 1920, NULL, NULL, 1, 1), ('AEK Atenas', 1924, 49, 44, 7, 1), ('Getafe CF B', 1975, 50, 1, 1, 1), ('CD Castellón', 1922, 51, 45, 1, 1), ('FC Crotone', 1910, 52, 46, 8, 1), ('Hércules CF', 1922, 53, 47, 1, 1),
('Burgos CF', 1936, 54, 48, 1, 1), ('Club Atlético de Madrid B', 1969, 55, 2, 1, 1), ('Liverpool FC', 1892, 56, 59, 9, 1), ('Real Madrid Castilla', 1930, 57, 2, 1, 1), ('UD San Sebastián de los Reyes', 1971, 58, 49, 1, 1),
('FC Twente', 1965, 59, 50, 5, 1), ('Sevilla Atlético', 1950, 60, 3, 1, 1), ('AJ Auxerre', 1905, 61, 51, 10, 1), ('SL Benfica', 1904, 62, 39, 2, 1), ('Atlético de Madrid Femenino', 2001, 63, 2, 1, 1), ('CD Alcoyano', 1928, 64, 31, 1, 1),
('FC Barcelona Femenino', 2002, 65, 5, 1, 1), ('FC Bayern de Múnich', 1900, 66, 52, 12, 1), ('UD Salamanca', 1923, 67, 53, 1, 1), ('Alicante CF', 1918, 68, 47, 1, 1), ('Olympique de Lyon', 1950, 69, 54, 10, 1), 
('FC Basilea', 1893, 70, 55, 11, 1), ('Juventus de Turín', 1897, 71, 56, 8, 1), ('AS Saint-Éttiene', 1919, 72, 57, 10, 1), ('CP Parla Escuela-Fair Play', 1989, 73, 58, 1, 1), ('Benirdorm CF', 1964, 75, 60, 1, 1), ('Zamora CF', 1968, 76, 61, 1, 1);

-- Aquí metemos los estadios --
INSERT INTO Estadios (nombre, id_localidad, id_pais) VALUES
('Coliseum', 1, 1), ('Estadio de Vallecas', 2, 1), ('Santiago Bernabéu', 2, 1), ('Ramón Sánchez Pizjuán', 3, 1), ('Metropolitano', 2, 1), ('Mestalla', 4, 1), ('Camp Nou', 5, 1), ('Estadio de la Cerámica', 6, 1),
('Visit Mallorca Estadi', 7, 1), ('Benito Villamarín', 3, 1), ('San Mamés', 8, 1), ('El Sadar', 9, 1), ('RCDE Stadium', 5, 1), ('Ciutat de València', 4, 1), ('Reale Arena', 10, 1), ('José Zorrilla', 11, 1), ('El Sardinero', 12, 1),
('Abanca Balaídos', 13, 1), ('Mendizorroza', 14, 1), ('La Rosaleda', 15, 1), ('Riazor', 16, 1), ('Power Horse Stadium', 17, 1), ('La Romareda', 18, 1), ('Montilivi', 19, 1), ('Butarque', 20, 1), ('Nuevo Los Cármenes', 21, 1),
('Gran Canaria', 22, 1), ('Nuevo Mirandilla', 23, 1), ('El Arcángel', 24, 1), ('Ipurua', 25, 1), ('Heliodoro Rodríguez López', 26, 1), ('Martínez Valero', 27, 1), ('Nuevo Colombino', 28, 1), ('Municipal Mariano González', 29, 1),
('El Alcoraz', 30, 1), ('Fernando Torres', 31, 1), ('Carlos Belmonte', 32, 1), ('El Toralín', 33, 1), ('Nueva Condomina',34, 1), ('El Molinón', 35, 1), ('Nou Estadi Costa Daurada', 36, 1), ('Los Pajaritos', 37, 1), ('Chapín', 38, 1),
('Estádio José Alvalade', 39, 2), ('Bloomfield Stadium', 40, 4), ('Johan Cruyff Arena', 41, 5), ('Reino de León', 42, 1), ('Lotto Park', 43, 6), ('OPAP Arena', 44, 7), ('Ciudad Deportiva Fernando Santos', 1, 1), 
('Nou Estadi Castalia', 45, 1), ('Stadio Ezio Scida', 46, 8), ('José Rico Pérez', 47, 1), ('El Plantío', 48, 1), ('Miniestadio Cerro del Espino', 2, 1), ('Anfield', 59, 9), ('Alfredo Di Stéfano', 2, 1), ('Matapiñonera', 49, 1),
('De Grolsch Veste', 50, 6), ('Ciudad Deportiva Jesús Navas', 3, 1), ('Stade de l´Abbé-Deschamps', 51, 10), ('Estádio da Luz', 39, 2), ('Centro Deportivo Alcalá de Henares', 2, 1), ('El Collao', 47, 1), ('Estadio Johan Cruyff',5, 1),
('Allianz Arena', 52, 12), ('Helmántico', 53, 1), ('Estadio Alicante CF', 47, 1), ('Groupama Stadium', 54, 10), ('St. Jakob-Park', 55, 11), ('Allianz Stadium', 56, 8), ('Stade Geoffroy-Guichard', 57, 10), ('Las Américas', 58, 1),
('Estadio Vicente Calderón', 2, 1), ('Guillermo Amor', 60, 1), ('Estadio Ruta de la Plata', 61, 1);

-- Aquí metemos las temporadas --
INSERT INTO Temporadas (temporada) VALUES
('2004/2005'), ('2005/2006'), ('2006/2007'), ('2007/2008'), ('2008/2009'), ('2009/2010'), ('2010/2011'), ('2011/2012'), ('2012/2013'), ('2013/2014'), ('2014/2015'), ('2016/2017'), ('2017/2018'), ('2018/2019'), ('2019/2020'), 
('2020/2021'), ('2021/2022'), ('2022/2023'), ('2023/2024'), ('2024/2025'), ('2025/2026');

-- -Aquí metemos las competiciones --
INSERT INTO Competiciones (nombre, id_pais) VALUES ('LaLiga EA Sports', 1), ('LaLiga Hypermotion', 1), ('2ªB', 1), ('Copa de S.M. El Rey', 1), ('Liga F', 1), ('UEFA Europa League', NULL), ('UEFA Champions League', NULL),
('Amistoso', NULL), ('Trofeo Santiago Bernabéu', 1), ('Segunda RFEF', 1); 

-- Aquí metemos las localidades --
INSERT INTO Localidad (nombre, id_pais) VALUES ('Getafe', 1), ('Madrid', 1), ('Sevilla', 1), ('Valencia', 1), ('Barcelona', 1), ('Vila-real', 1), ('Mallorca', 1), ('Bilbao', 1), ('Pamplona', 1), ('San Sebastián', 1), ('Valladolid', 1),
('Santander', 1), ('Vigo', 1), ('Vitoria', 1), ('Málaga', 1), ('A Coruña', 1), ('Almería', 1), ('Zaragoza', 1), ('Girona', 1), ('Leganés', 1), ('Granada', 1), ('Las Palmas', 1), ('Cádiz', 1), ('Córdoba', 1), ('Eibar', 1), 
('Santa Cruz de Tenerife', 1), ('Elche', 1), ('Huelva', 1), ('Navalcarnero', 1), ('Huesca', 1), ('Fuenlabrada', 1), ('Albacete', 1), ('Ponferrada', 1), ('Murcia', 1), ('Gijón', 1), ('Tarragona', 1), ('Soria', 1),
('Jerez de la Frontera', 1), ('Lisboa', 2), ('Tel Aviv', 4), ('Ámsterdam', 5), ('León', 1), ('Bruselas', 6), ('Atenas', 7), ('Castellón de la Plana', 1), ('Crotone', 8), ('Alicante', 1), ('Burgos', 1), ('San Sebastián de los Reyes', 1),
('Enschede', 6), ('Auxerre', 10), ('Múnich', 12), ('Salamanca', 1), ('Lyon', 10), ('Basilea', 11), ('Turín', 8), ('Saint-Étienne', 10), ('Parla', 1), ('Liverpool', 9), ('Benidorm', 1), ('Zamora', 1), ('Augsburgo', 12);

-- Aquí metemos los países --
INSERT INTO Pais (nombre) VALUES ('España'), ('Portugal'), ('Brasil'), ('Israel'), ('Países Bajos'), ('Bélgica'), ('Grecia'), ('Italia'), ('Inglaterra'), ('Francia'), ('Suiza'), ('Alemania');

